---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilyWorkPlaneBased
source: html/fdc4b575-9a16-417f-5ba3-1679865dca8a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilyWorkPlaneBased Property

"Work Plane-Based"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilyWorkPlaneBased { get; }
```